tutorials/testcases/flowOverCylinder/Re3900/3d_transient_vfine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          25024;
        startFace       47515383;
    }
    inner
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          25024;
        startFace       47540407;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       outer;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          193793;
        startFace       47565431;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          193793;
        startFace       47759224;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
    inlet
    {
        type            patch;
        nFaces          240;
        startFace       47953017;
    }
    outlet
    {
        type            patch;
        nFaces          9648;
        startFace       47953257;
    }
    sides
    {
        type            patch;
        nFaces          480;
        startFace       47962905;
    }
    outer
    {
        type            bellerophon;
        inGroups        1(bellerophon);
        nFaces          95232;
        startFace       47963385;
        matchTolerance  0.0001;
        transform       unknown;
        donorZone       inner;
    }
)

// ************************************************************************* //
