tutorials/testcases/flowOverCylinder/Re3900/3d_transient_vfine/0.org/nuSgs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuSgs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-11; 

boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }
    inner
    {
        forceInterpolation 1;
        bound           1;
        type            bellerophon;
        value           uniform 1e-11;
    }
    "front|back"
    {
        type            cyclic;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
    outer
    {
        forceInterpolation 1;
        bound           1;
        type            bellerophon;
        value           uniform 1e-11;
    }
}


// ************************************************************************* //
